Update README
Accuracy updates, descriptions and other changes
